In [1]:
import pandas as pd

In [ ]:
# convert List / tuple into Series 
# Series is 1D data structure
# it cant handle mixed data types
# Series(values , index , dtype)

In [2]:
sr1 = pd.Series([10,20,30,40,50])
sr1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
sr1[3]

40

In [ ]:
# numbers: int/ float
# strings: object

In [4]:
sr2 = pd.Series([10,20,30,40,50], index = ['a','b','c','d','e'], dtype = float)
sr2

a    10.0
b    20.0
c    30.0
d    40.0
e    50.0
dtype: float64

In [ ]:
# python is dynamically typed programming language --> data types are auto assigned 
# SMALLINT / BIGINT --> 32/64 (on its own )

In [5]:
sr2['d']

40.0

In [9]:
type(sr2)

pandas.core.series.Series

In [ ]:
# Data Frame 
# 2D table 
# value are inserted using columns 
# columns can be anything: list , tuple , Series , 1D array

In [10]:
dict1 = {
    'col1': [10,20,30,40,50],
    'col2': pd.Series(['a','b','c','d','e'])
}

In [11]:
df1 = pd.DataFrame(dict1)
df1

   col1 col2
0    10    a
1    20    b
2    30    c
3    40    d
4    50    e

In [12]:
type(df1)

pandas.core.frame.DataFrame

In [13]:
df1.dtypes

col1     int64
col2    object
dtype: object

In [15]:
import numpy as np

In [16]:
ar1 = np.array([[10,'a'],[20,'b']])
ar1

array([['10', 'a'],
       ['20', 'b']], dtype='<U21')

In [19]:
# bool --> int --> float --> complex --> strings (hierarchy of data types)

In [17]:
df2 = pd.DataFrame({
    'rating': [10,20,30,'python',50],
    'col2': pd.Series(['a','b','c','d','e'])
})
df2

   rating col2
0      10    a
1      20    b
2      30    c
3  python    d
4      50    e

In [18]:
df2.dtypes

rating    object
col2      object
dtype: object

In [ ]:
# Merge
# sql joins = pandas merge

In [20]:
df1 = pd.DataFrame({'id': [1,2,3,4,5], 'stat_marks': [94,95,97,99,90]})
df2 = pd.DataFrame({'id': [3,4,5,6,7], 'ml_marks': [91,89,91,88,94]})
df2

   id  ml_marks
0   3        91
1   4        89
2   5        91
3   6        88
4   7        94

In [ ]:
# extract stat marks and ml marks for students who appeared in both the exams
# select * from df1 inner join df2 on df1.id = df2.id # sql query

In [21]:
df1.merge(df2, on = 'id', how = 'inner')

   id  stat_marks  ml_marks
0   3          97        91
1   4          99        89
2   5          90        91

In [22]:
df1.merge(df2, on = 'id', how = 'left')

   id  stat_marks  ml_marks
0   1          94       NaN
1   2          95       NaN
2   3          97      91.0
3   4          99      89.0
4   5          90      91.0

In [ ]:
# NaN --> Not a Number / blank / missing / null value / empty

In [23]:
df1.merge(df2, on = 'id', how = 'right')

   id  stat_marks  ml_marks
0   3        97.0        91
1   4        99.0        89
2   5        90.0        91
3   6         NaN        88
4   7         NaN        94

In [24]:
df1.merge(df2, on = 'id', how = 'outer')

   id  stat_marks  ml_marks
0   1        94.0       NaN
1   2        95.0       NaN
2   3        97.0      91.0
3   4        99.0      89.0
4   5        90.0      91.0
5   6         NaN      88.0
6   7         NaN      94.0

In [25]:
df1.merge(df2, how = 'cross') # pick one value from df1 and join with all the rows in df2 and repeat the process for all the rows in df1

    id_x  stat_marks  id_y  ml_marks
0      1          94     3        91
1      1          94     4        89
2      1          94     5        91
3      1          94     6        88
4      1          94     7        94
5      2          95     3        91
6      2          95     4        89
7      2          95     5        91
8      2          95     6        88
9      2          95     7        94
10     3          97     3        91
11     3          97     4        89
12     3          97     5        91
13     3          97     6        88
14     3          97     7        94
15     4          99     3        91
16     4          99     4        89
17     4          99     5        91
18     4          99     6        88
19     4          99     7        94
20     5          90     3        91
21     5          90     4        89
22     5          90     5        91
23     5          90     6        88
24     5          90     7        94